heliumholt/esp32-modbus-gateway/sdkconfig.defaults
# ESP32S3 target
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP32S3_SPIRAM_SUPPORT=y

# SPIRAM (OCT = 8-line, fastest)
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Flash (16MB QIO @ 80MHz)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bootloader (OTA rollback support)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

# OTA (HTTPS only — HTTP disabled for security)
CONFIG_ESP_TLS_CERT_BUNDLE=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="esp32s3_modbus"

# MQTT
CONFIG_MQTT_OUTBOX_EXPIRED_TIMEOUT_MS=30000

# UART

# Log level (reduce in production)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Project-specific defaults (MODBUS Gateway)
CONFIG_MODBUS_GW_WIFI_SSID=""
CONFIG_MODBUS_GW_DEVICE_NAME="esp32s3_modbus"
CONFIG_MODBUS_GW_MQTT_URI="mqtt://test.mosquitto.org"
CONFIG_MODBUS_GW_UART_TX=16
CONFIG_MODBUS_GW_UART_RX=17
CONFIG_MODBUS_GW_UART_DE=8

# LVGL (RGB565 byte swap for SPI LCD — ILI9341 expects big-endian over SPI)
CONFIG_LV_COLOR_16_SWAP=y
# Disable default theme: its gradients band in RGB565 -> vertical lines. Use BASIC (flat colors).
# CONFIG_LV_USE_THEME_DEFAULT is not set
CONFIG_LV_USE_THEME_BASIC=y
